print('Поиск НОД')

m = int(input('Введите первое число: '))
n = int(input('Введите второе число: '))

# =============================================================================
# while m != n:
#     if m > n:
#         m = m - n
#     else:
#         n = n - m
#         
# print('Общий делиель равняется: ', n)       
# =============================================================================

def nod(n,m):
    if m == n:
        return m
    if m < n:
        return nod(m, n - m)
    else:
        return nod(m - n, n)
print('Общий делиель равняется: ', n) 