import numpy as np

# =============================================================================
# x = np.array([[1,2],[3,4]])
# 
# y = np.array([[5,6],[7,8]])
# 
# arr = np.array([1,2])
# 
# 
# print('Матрица X:  \n', x)
# print()
# print('Матрица Y: \n', y)
# print()
# print('Матрица arr: \n', arr)
# 
# z = x + y
# z1 = x + 2
# z2 = x + arr
# z_add = np.add(x,y)
# 
# print()
# print('Матрица Z, сумма матриц X и Y: \n', z)
# print()
# print('Матрица Z1, результат прибавления к матрице X двойки(2): \n', z1)
# print()
# print('Матрица Z2, сумма матриц X и arr: \n', z2)
# print()
# print('Матрица z_add, результат сложения матриц X и Y с помощью ф-ции ".add": \n', z_add)
# 
# =============================================================================

a1 = np.array([1,2,3])
print(a1)

Z = np.empty_like(a1)

a2 = np.array([4,5,6])
print(a2)

a3 = np.array([True, False, True])
print(a3)

# =============================================================================
# a4 = np.add(a1,a2)
# print(a4)
# =============================================================================
print()

np.add(a1,a2,out = Z, where = a3)
print(Z)