print('Методы и функции словарей')

# =============================================================================
# dict = {2 :'A', 'a': 3, (2,5):-7}
# print()
# print('Методы')
# print()
# print(dict.keys()) #dict_keys([2, 'a', (2, 5)])
# 
# print(dict.items()) #dict_items([(2, 'A'), ('a', 3), ((2, 5), -7)])
# 
# print(dict.copy()) #{2: 'A', 'a': 3, (2, 5): -7}
# 
# print('длинна словаря',len(dict)) #длинна словаря 3
# 
# print(dict.get(2)) # A
# 
# print(dict.get(7))
# print(dict.get(7,'элемента с таким ключом нет'))
# 
# dict.clear()
# print(dict)
# 
# =============================================================================



