import pandas as pd
import numpy as np


# =============================================================================
# #Эл. словаря из структуры Series
# d = {'A': pd.Series([1,2,3],index = ['a','b','c']), 'B': pd.Series([6,7,8], index = ['a','b','c'])}
# df = pd.DataFrame(d)
# print(df)
# print(df.index)
# print(df.columns)
# =============================================================================

# =============================================================================
# # Создание словаря на элементах одномерного массива nd.array
# d1 = {'A':np.array([1,2,3]), 'B':np.array([6,7,8])}
# df1 = pd.DataFrame(d1, index = ['a', 'b', 'c'])
# print(df1)
# 
# =============================================================================

# Создание словаря на элементах списка
d1 = {'A':[1,2,3], 'B':[6,7,8]}
df1 = pd.DataFrame(d1, index = ['a', 'b', 'c'])
print(df1)