import pandas as pd
import numpy as np


# =============================================================================
# Печать столбца "b"
# d = {'a':np.array([1,2,3]),'b':np.array([10,20,30])}
# df = pd.DataFrame(d, index = ['A', 'B', 'C'])
# print(df)
# print('\nВыбор столбца:')
# print(df['b'])
# 
# =============================================================================

# =============================================================================
# Печать строки "А"
# d = {'a':np.array([1,2,3]),'b':np.array([10,20,30])}
# df = pd.DataFrame(d, index = ['A', 'B', 'C'])
# print(df)
# print('\nВыбор столбца:')
# print(df.loc['A'])
# =============================================================================

# =============================================================================
# # Поиск по индексу в DataFrame
# d = {'a':np.array([1,2,3]),'b':np.array([10,20,30])}
# df = pd.DataFrame(d, index = ['A', 'B', 'C'])
# print(df)
# print('\nВыбор столбца:')
# print(df.iloc[1])
# =============================================================================

# =============================================================================
# Печать среза по строкам в структуре DataFrame
# d = {'a':np.array([1,2,3]),'b':np.array([10,20,30])}
# df = pd.DataFrame(d, index = ['A', 'B', 'C'])
# print(df)
# print('\nВыбор столбца:')
# print(df[1:2])
# =============================================================================

d = {'a':np.array([1,2,3]),'b':np.array([10,20,30])}
df = pd.DataFrame(d, index = ['A', 'B', 'C'])
print(df)
print('\nВыбор столбца:')
print(df['a']>2)
