print('Алгоритм Эратосфена')

N = int(input('Введите натуральное число: '))

A = [True] * (N+1)

k = 2

while k * k <= N:
    if A[k]:
        i = k * k 
        while i <= N:
            A[i] = False
            i = i + k
# =============================================================================
#             for i in range(k*k, N+1, k):
#                 A[i] = False
# =============================================================================
    k = k + 1

for i in range(2, N+1): 
    if A[i]:
        print(i, end = ', ')
    
