print('Линейная Апроксимация функции')


def aproxim(X,Y,X_):
    Sum_X = 0
    Sum_Y = 0
    Sum_X2 = 0
    Sum_XY = 0
        
    for i in range(N):
        Sum_X += X[i]
        Sum_Y += Y[i]
        Sum_X2 += X[i] * X[i]
        Sum_XY += X[i] * Y[i]
    a = (N *  Sum_XY - Sum_X * Sum_Y) / (N * Sum_X2 - Sum_X ** 2 )  
    b = 1/N * (Sum_Y - a * Sum_X)
    y = a * X_ + b
    print('Коэфициент a апроксимирующей функции равен',a)
    print('Коэфициент b апроксимирующей функции равен',b)
    return y


N = int(input('Введите количество точек: '))

# =============================================================================
# X = [int(input('Введите значение X: ')) for i in range(N)]
# 
# Y = [int(input('Введите значение Y: ')) for i in range(N)]
# =============================================================================


X = [2, 6, 10, 14, 18]
Y = [9, 10, 12, 19, 20]

X_ = int(input('Введите значение X_: '))

Y_ = aproxim(X,Y,X_)

print('Значение апроксимирующей функции в точке X={} равно {}'.format(X_,Y_))