print('ДЗ Метод Ньютона(метод касательных)')


# =============================================================================
# # график функции
# x = -2
# for i in range(0,8):
#     y = x ** 4 - 2 * x - 4
#     print (x, '=' , y)
#     x += 1
# =============================================================================
    
    

a = int(input('Введите левое значение: '))
b = int(input('Введите правое значение: '))
eps = float(input('Введите приблежение: '))

def f(x):
    return x ** 4 - 2 * x - 4

def F(x):
    return 4 * x ** 3 - 2

x0 = b
while abs(f(x0)) > eps:
    x1 = x0 - f(x0) / F(x0)
    x0 = x1
print('Приближенное значение корня равняется: {:.2f}'.format(x0))      
    