print('Обработка ошибок')


a = int(input('Введите 1-е число: '))
b = int(input('Введите 2-е число: '))
# =============================================================================
# c = a / b
# print('Частное от деления', a, 'на', b, '=', c)
# =============================================================================

try:
    c = a / b
    print(c)
except:
    if a == 0 and b == 0:
        print('Результат деления - бесконечное множество значений')
    else:
        print('Ошибка! На "0" делить нельзя ')
    