print('Создание, запись и чтение с последующей сортировкой структуры')

import pickle


# =============================================================================
# Fout = open('G:\List_books.dat','wb')
# =============================================================================


class Tbook:
    author = ' '
    title = '' 
    pages = 0
    
  
# =============================================================================
# N = int(input('Введите количество записей: '))
# 
# books = [Tbook() for i in range(N)]
# 
# for i in range(N):
#     books[i].author = input('Фамилия автора: ')
#     books[i].title = input('Название произведения: ')
#     books[i].pages = int(input('Количество страниц: '))
# 
# 
# print('-' * 35)
# print(' Автор ', ' Название ', 'Кол.стр' )
# print('-' * 35)
# for i in range(N):
#     print(books[i].author,books[i].title,books[i].pages)
#     
# pickle.dump(books, Fout) #сохранение массива структур одним махом(целиком)
# Fout.close()
# =============================================================================



Fin = open('G:\List_books.dat','rb') 

a = pickle.load(Fin)               # чтение структуры одним махом(целиком)
print(a.author, a.title, a.pages)
Fin.close



# =============================================================================
# for b in books:            # Запись массива структур по одной 
#     pickle.dump(b, Fout)
# =============================================================================


# =============================================================================
# Fin = open('G:\List_books.dat','rb') # чтение массива структур по одной
# 
# books_1 = [0] * 3
# 
# for i in range(3):
#     books_1[i] = pickle.load(Fin)
# 
# =============================================================================

# =============================================================================
# 
# 
# 
# 
# n = len(books) 
# for i in range(n-1):
#     for j in range(n-2, i-1, -1):
#         if books[j].author > books[j+1].author:
#             books[j],books[j+1] = books[j+1],books[j]        
# 
# print()
# print('Отсортированный список авторов')    
# print('-' * 35)
# print(' Автор ', ' Название ', 'Кол.стр' )
# print('-' * 35)
# for i in range(N):
#     print(books[i].name,books[i].breed,books[i].age)    
# =============================================================================

