print('Слияние словарей')

A = {'x': 1, 'y': 2 }
B = {'a': 10, 'b': 11}
# =============================================================================
# C = A|B
# print(C) #{'x': 1, 'y': 2, 'a': 10, 'b': 11} # Создан новый словарь С
# print(A)
# =============================================================================

A|=B
print(A) # {'x': 1, 'y': 2, 'a': 10, 'b': 11} # К словарю А добавился словарь В

n = A.pop('a') # метод удаляет пару ключ\значение, при этом возвращает значение
print(A)
print(n)
