print('Сортировка словаря')

A = {'a': 1, 'c': 3, 'b': 2, 'e': 5, 'd': 4, 'g': 7, 'f': 6, 'i': 9, 'h': 8}
print(A)
print()
# =============================================================================
# print(A.keys())
# List_keys = list(A.keys())
# List_keys.sort()
# print(List_keys)
# 
# for x in List_keys:
#     print(x,':', A[x])
# =============================================================================
    
# =============================================================================
# A_tuple = A.items()
# print(A_tuple)
# =============================================================================

print('Сортировка')
print()
A_sort = sorted(A.items(), key=lambda x: x[1])
for x in A_sort:
    print(x)

